КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_СервисФизическихЛиц/КонтурЛогистика_СервисФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_СервисФизическихЛиц</name>
  <resources>
    <name>PersonId</name>
    <comment>Идентификатор физического лица в сервисе физ лиц. У одного сотрудника будут разные id в разных организациях</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>UserId</name>
    <comment>Идентификатор связанного портального пользователя. Появляется после принятия приглашения. Для водителей связка выполняется по номеру телефона. Для разных personId может быть один UserId</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыФизическихЛиц</types>
    </type>
  </resources>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОшибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>InviteId</name>
    <comment>Идентификатор приглашения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонОсновной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВУДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВУНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВУСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IdentityDocumentId</name>
    <comment>Идентификатор документа в сервисе физ. лиц</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонСовпадает</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СценарийПриглашения</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СценарииПриглашенийФизическихЛиц</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_СервисФизическихЛиц/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Сотрудник", ОтборСотрудник);
	Параметры.Свойство("Организация", ОтборОрганизация);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтборы();
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтборСотрудникПриИзменении(Элемент)
	ОбновитьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	ОбновитьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура ОтборТелефонПриИзменении(Элемент)
	ОбновитьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСотрудникОчистка(Элемент, СтандартнаяОбработка)
	ОбновитьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	ОбновитьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура ОтборТелефонОчистка(Элемент, СтандартнаяОбработка)
	ОбновитьОтборы();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормы()
	
	Если ТипЗнч(ВладелецФормы) = Тип("УправляемаяФорма") Тогда
		
		Если ВладелецФормы.ИмяФормы = "Справочник.КонтурЛогистика_Сотрудники.Форма.ФормаЭлемента" Тогда
			Элементы.ОтборСотрудник.ТолькоПросмотр = ЗначениеЗаполнено(ОтборСотрудник);
		КонецЕсли;
		
		Если ВладелецФормы.ИмяФормы = "Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаЭлемента" Тогда
			Элементы.ОтборОрганизация.ТолькоПросмотр = ЗначениеЗаполнено(ОтборОрганизация);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтборы()
	
	КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Сотрудник", ОтборСотрудник,
		ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборСотрудник));
		
	КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Организация", ОтборОрганизация,
		ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборОрганизация));
		
	КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Телефон", ОтборТелефон,
		ВидСравненияКомпоновкиДанных.Содержит,, ЗначениеЗаполнено(ОтборТелефон));
	
КонецПроцедуры

#КонецОбласти
